In [1]:
import pandas as pd
import numpy as np

In [2]:
data_dic = {'name': ['sohail', 'danyal','hamza','mehran'], 'age': [28,27,22,np.nan]}

In [3]:
data = pd.DataFrame(data_dic)

In [4]:
data.head()

     name   age
0  sohail  28.0
1  danyal  27.0
2   hamza  22.0
3  mehran   NaN

In [5]:
data['age'] = data['age'].fillna(np.mean(data['age']))

In [6]:
data.head()

     name        age
0  sohail  28.000000
1  danyal  27.000000
2   hamza  22.000000
3  mehran  25.666667